from pynput.keyboard import Key, KeyCode

swap_args = {
    # Клавиши на панели
    'sequnce': [[Key.f1, Key.f2, Key.f3, Key.f4, Key.f5], 'xczf'],
    # Клавиша свапа панели
    'move': [Key.end],
    # Клавиши для свапа
    'trigger': KeyCode.from_char('='),
}

ru_by_eng_letters = {
    'q': 'й',
    'w': 'ц',
    'e': 'у',
    'r': 'к',
    't': 'е',
    'y': 'н',
    'u': 'г',
    'i': 'ш',
    'o': 'щ',
    'p': 'з',
    '[': 'х',
    ']': 'ъ',
    'a': 'ф',
    's': 'ы',
    'd': 'в',
    'f': 'а',
    'g': 'п',
    'h': 'р',
    'j': 'о',
    'k': 'л',
    'l': 'д',
    ';': 'ж',
    "'": 'э',
    'z': 'я',
    'x': 'ч',
    'c': 'с',
    'v': 'м',
    'b': 'и',
    'n': 'т',
    'm': 'ь',
    ',': 'б',
    '.': 'ю',
    '/': '.'
 }
